AccountingRegisters/РегистрУправленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>РегистрУправленческий</Name>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеБаланса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПоНалоговомуУчету</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccountingRegisters/РегистрУправленческий/Ext/RecordSetModule.bsl
Процедура ДобавитьПроводку() Экспорт
	
	Проводка = Добавить();
	Проводка.Период = ТекущаяДата();
	Проводка.СчетДт = ПланыСчетов.Управленческий.ТоварыНаСкладах;
	Проводка.СчетКт = ПланыСчетов.Управленческий.ОтечественныеПоставщики;
	Проводка.Сумма = 10000;
	
	
КонецПроцедуры

Процедура ЗаполнитьПериод()
	
	
	
КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	Ссылка = Отбор.Регистратор.Значение;
	Дата = Ссылка.Дата;
	Попытка
		
		КурсВалютыБаланса = Ссылка.КурсВалютыБаланса;
		
		
	Исключение
		КурсВалютыБаланса = 0;
		
	КонецПопытки;
	Для каждого Проводка Из ЭтотОбъект Цикл
		               	
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Операция") Тогда
			
			Проводка.Период=Дата;
			Проводка.Организация = Ссылка.Организация;
		КонецЕсли; 
		Если КурсВалютыБаланса = 0 Тогда
		    Проводка.СуммаВВалютеБаланса =0;
			
		Иначе
			Проводка.СуммаВВалютеБаланса =Проводка.Сумма/КурсВалютыБаланса;
		
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, РежимЗаписи)
	Ссылка = Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Операция") Тогда
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрУправленческийОстатки.Субконто1 КАК Товар,
		|	-РегистрУправленческийОстатки.КоличествоОстатокДт КАК Нехватка
		|ИЗ
		|	РегистрБухгалтерии.РегистрУправленческий.Остатки(
		|			&Момент,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ТоварыНаСкладах),
		|			,
		|			Субконто1 В
		|				(ВЫБРАТЬ
		|					РегистрУправленческийДвиженияССубконто.СубконтоКт1
		|				ИЗ
		|					РегистрБухгалтерии.РегистрУправленческий.ДвиженияССубконто(, , Регистратор = &Ссылка
		|						И СчетКт = ЗНАЧЕНИЕ(ПланСЧетов.Управленческий.ТоварыНаСкладах), , ) КАК РегистрУправленческийДвиженияССубконто)) КАК РегистрУправленческийОстатки
		|ГДЕ
		|	РегистрУправленческийОстатки.КоличествоОстатокДт < 0";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Граница = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая);
		Запрос.УстановитьПараметр("Момент", Граница);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Отказ = Истина;
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Товара "+ВыборкаДетальныеЗаписи.Товар
				+" недостаточно в количестве "+ВыборкаДетальныеЗаписи.Нехватка;
				Сообщение.Сообщить(); 
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	
КонецПроцедуры
